tsung/sample.xml
<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice" version="1.0">

<clients>
<client host="localhost" weight="1" cpu="1" use_controller_vm="true" />
</clients>

<servers>
<server host="localhost" port="80" type="tcp"/>
</servers>

<load>
<arrivalphase phase="1" duration="20" unit="second">
<users maxnumber="15000" arrivalrate="40" unit="second"/>
</arrivalphase>

<!--<arrivalphase phase="2" duration="20" unit="second">-->
<!--<users maxnumber="15000" arrivalrate="8" unit="second"/>-->
<!--</arrivalphase>-->

<!--<arrivalphase phase="3" duration="20" unit="second">-->
<!--<users maxnumber="20000" arrivalrate="8" unit="second"/>-->
<!--</arrivalphase>-->
</load>

<sessions>
<session probability="100" name="ab" type="ts_http">
<for from="1" to="2000" var="i">
<request> <http url="http://app:3300" method="GET" version="1.1"/> </request>
</for>
</session>
</sessions>
</tsung>